#!/bin/bash


# 解压位置   程序名字  程序md5
# $1        $2         $3

# shellcheck disable=SC2164
cd "$1"
rm -rf  "$2"
# shellcheck disable=SC2164
checkFUnc() {
  code=0
  go build
   # shellcheck disable=SC2181
   if [ $? -ne 0 ]; then
    echo "============================================================="
    echo "文件编译失败"
    echo "============================================================="
    code=1
  else
    echo "============================================================="
    echo "文件编译成功"
    echo "============================================================="
  fi

  # shellcheck disable=SC2034
  build_hash_code=$(md5 "$1")
  # shellcheck disable=SC1009
  if [ "$build_hash_code" = "$2" ]; then
    echo "============================================================="
    echo "文件和程序内容一致"
    echo "============================================================="
  else
    echo "============================================================="
    echo "文件和程序内容不一致"
    echo "============================================================="
    code=1
  fi

  #检查英语语法
  # shellcheck disable=SC2038
  find . -name "*" | xargs misspell -error
  # shellcheck disable=SC2181
  if [ $? -ne 0 ]; then
    echo "============================================================="
    echo "检测到英文语法有问题"
    echo "============================================================="
    code=1
  else
    echo "============================================================="
    echo "未检测到英文语法问题"
    echo "============================================================="
  fi

  #检查md格式
  find ./ -name "*.md" | grep -v commandline | grep -v .github | grep -v swagger | grep -v api | xargs mdl -r ~MD009,~MD002,~MD007,~MD010,~MD013,~MD024,~MD026,~MD029,~MD033,~MD034,~MD036,~MD04
  # shellcheck disable=SC2181
  if [ $? -ne 0 ]; then
    echo "============================================================="
    echo "检测到md格式有问题"
    echo "============================================================="
  else
    echo "============================================================="
    echo "未检测到md格式问题"
    echo "============================================================="
  fi

  #检查链接
  set +e
  for name in $(find . -name \*.md | grep -v CHANGELOG); do
    # shellcheck disable=SC2086
    if [ -f $name ]; then
      markdown-link-check -q -v $name
      # shellcheck disable=SC2181
      if [ $? -ne 0 ]; then
        echo "============================================================="
        echo "检测到无效的链接"
       echo "============================================================="
      else
        echo "============================================================="
        echo "未检测到无效的链接"
       echo "============================================================="
      fi
    fi
  done

  #检查yaml格式
  # shellcheck disable=SC2038
  find . -name "*.yml" | xargs yamllint -d "{extends: default, rules: {line-length: disable}}"
  # shellcheck disable=SC2181
  if [ $? -ne 0 ]; then
    echo "============================================================="
    echo "检测到yml格式问题"
    echo "============================================================="
  else
    echo "============================================================="
    echo "未检测到yml格式问题"
    echo "============================================================="
  fi

  #检查shell
  # shellcheck disable=SC2038
  find . -name "*.sh" | xargs shellcheck
  # shellcheck disable=SC2181
  if [ $? -ne 0 ]; then
    echo "============================================================="
    echo "检测到shell格式问题"
    echo "============================================================="
  else
    echo "============================================================="
    echo "未检测到shell格式问题"
    echo "============================================================="
  fi

  #检查go格式
  golangci-lint run
  # shellcheck disable=SC2181
  if [ $? -ne 0 ]; then
    echo "============================================================="
    echo "检测到go语言代码不规范"
    echo "============================================================="
  else
     echo "============================================================="
    echo "未检测到go语言代码不规范"
    echo "============================================================="
  fi

  return $code
}

checkFUnc "$2" "$3"
# shellcheck disable=SC2181
if [ $? -ne 0 ]; then
  echo "00失败00"
else
  echo "11成功11"
fi
